assemblies/samples/src/main/resources/transformations/files/WebServicesMovieListingAsHTTP_SOAPRequest.xml

<?xml version="1.0" encoding="UTF-8"?><!-- ******************************************************************************
 *
 * Pentaho
 *
 * Copyright (C) 2026 by Pentaho Canada Inc. : http://www.pentaho.com
 *
 * Use of this software is governed by the Business Source License included
 * in the LICENSE.TXT file.
 *
 * Change Date: 2030-06-15
 ******************************************************************************* -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns="http://www.ignyte.com/whatsshowing"><soapenv:Header/><soapenv:Body><ns:GetTheatersAndMovies><ns:zipCode>32822</ns:zipCode><ns:radius>10</ns:radius></ns:GetTheatersAndMovies></soapenv:Body></soapenv:Envelope>